package ua.dp.ort.homework3;

public class Bit {
	
	public static void main(String[] args) {
			//  ”краинский алфавит 1 bit- 1 or 0
			//  ”становлено 0- гласные буквы, 1- согласные буквы
	System.out.println("101111100110001111101111011111100");
	
//	2019 год,мес€ц Ќо€брь 1 bit- 1 or 0  , мес€ц содержит 30 дней
//	”становлено 0- выходные дни(суббота и воскресенье), 1- рабочие дни
	System.out.println("1100111110011111001111100111110");
	
	
//	 ”становлено 1- учебные мес€ца,  в году 12 мес€цев и 3 мес€ца не учебных
	System.out.println("111110001111");

	}

}
