package ua.dp.ort.homework3;

public class Bit {
	
	public static void main(String[] args) {
			//  ”краинский алфавит 1 bit- 1 or 0
			//  ”становлено 0- гласные буквы, 1- согласные буквы
	System.out.println("101111100110001111101111011111100");
	
//	Ќо€брь 1 bit- 1 or 0  , мес€ц содержит 30 дней
//	”становлено 0- выходные дни(суббота и воскресенье), 1- рабочие дни
	System.out.println("1100111110011111001111100111110");
	
	
//	√од 1 bit- 1 or 0  ,  содержит 12 мес€цев
//	”становлено 0 - школьные летние каникулы( июнь, июль, август), 1- учебные мес€ца
	System.out.println("1111110001111");

	}

}
